Revit 2015 API
BuiltInFailures.KeyBasedTreeEntryFailures.InvalidClassificationCode Property
 The classification code [Code] doesn't match level [Level] and parent code [ParentCode].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidClassificationCode { get; }
Visual Basic
Public Shared ReadOnly Property InvalidClassificationCode As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidClassificationCode {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace